[
  {
    "category": "General",
    "emoji": "📌",
    "questions": [
      "Who is one ex you would go back to—if they'd take you?",
      "Have you ever been in love with two people at once?",
      "If your best friend's partner hit on you, would you tell or stay quiet?",
      "Have you ever faked love, an orgasm, or affection just to keep someone?",
      "What’s the most manipulative thing you’ve done in a relationship?",
      "How much would someone have to pay you to betray a friend?",
      "Would you sleep with someone you despise for $10,000?",
      "If you could become rich but had to erase one person from existence, would you?",
      "What would you do if your partner became broke and jobless forever?",
      "Who’s someone you envy to the point of hatred?",
      "Have you ever celebrated someone else’s failure? Who?",
      "Do you secretly hope someone never succeeds—just so you don’t feel left behind?",
      "Have you ever ghosted someone just because they were too happy?",
      "Who do you wish would lose everything out of spite?",
      "What’s something you hope your ex regrets forever?",
      "Who’s someone you secretly wish would crash and burn?",
      "Have you ever told a cruel truth just to hurt? Explain.",
      "Have you ever convinced someone they were the problem just to avoid blame?",
      "What’s a lie you repeated so much, it became your truth?",
      "Have you ever played both sides in a fight just to watch people burn?",
      "Have you ever made someone question their sanity?",
      "Have you ever gaslighted someone into loving you more?",
      "Do you enjoy having someone obsessed with you?",
      "Have you ever pushed someone toward a breakdown?",
      "Have you ever exploited someone's weakness for your own gain?",
      "Who’s someone you “rescued” just to keep under control?",
      "What’s something you’ve done that you hope no one ever discovers?",
      "Have you ever thought someone deserved the abuse they got?",
      "What’s the one thing that would make everyone walk away from you if they knew?",
      "Have you ever laughed at someone else’s trauma?",
      "What’s a secret you’ve buried so deep it hurts to remember?",
      "Have you ever been glad someone got hurt or ruined?",
      "Who’s someone you lied to and it cost them something huge?",
      "What’s a sin you committed and never regretted?",
      "Have you ever made someone hate themselves?",
      "Who’s someone you’ve silently plotted against?",
      "What’s the pettiest revenge you’ve ever taken and loved?",
      "Have you ever ruined someone’s reputation on purpose?",
      "What’s a secret about someone you keep just in case?",
      "Would you leak nudes if it meant destroying someone who hurt you?",
      "Have you ever lied about being abused just to hurt someone?",
      "Have you ever sabotaged someone’s success to feel superior?",
      "What’s a cruel nickname you gave someone behind their back?",
      "Have you ever set someone up to fail and smiled when they did?"
    ]
  },
  {
    "category": "Friendship & Loyalty",
    "emoji": "🤝",
    "questions": [
      "Who’s your least favorite person in this group?",
      "Have you ever started a rumor about someone?",
      "Who do you trust the least out of your close friends?",
      "What’s something you’ve never forgiven a friend for—but they don’t know it?",
      "Have you ever talked shit about your best friend behind their back?",
      "Have you ever flirted with a friend’s partner?",
      "Would you bail your best friend out of jail if it cost you your savings?",
      "Have you ever ghosted a friend without explanation?",
      "Do you think any of your friends are secretly fake?",
      "Would you let a friend take the fall for something you did?",
      "Do you trust anyone 100%? If so, why?",
      "Who in your life would betray you the fastest?",
      "Have you ever set someone up to fail in a relationship?",
      "What’s a manipulative trick you always use in arguments?",
      "Have you ever used crying to win?",
      "Do you secretly keep people close just to feel in control?",
      "Have you ever exposed a secret someone trusted you with?",
      "What’s something you know would destroy someone if it got out?",
      "Have you ever felt proud after emotionally hurting someone?",
      "Who’s someone you would emotionally blackmail if you had to?"
    ]
  },
  {
    "category": "Sex & Intimacy",
    "emoji": "💋",
    "questions": [
      "What’s your body count?",
      "Have you ever hooked up with someone and instantly regretted it?",
      "Would you ever do a threesome—who with?",
      "What turns you on that you’re too embarrassed to admit?",
      "Have you ever filmed yourself doing it?",
      "Have you ever fantasized about someone in this group?",
      "What’s the most public place you’ve done it?",
      "Have you ever lied about being a virgin?",
      "What’s a kink you want to try but haven’t?",
      "Do you prefer rough or romantic?",
      "What’s a sexual act you’ve done but would never tell family about?",
      "What’s your secret go-to porn category?",
      "Who’s someone you fantasized about but would never approach?",
      "Have you ever had sex with someone just because you were bored?",
      "What’s something that’s happened during sex you’ll never forget?",
      "What’s the dirtiest message you’ve ever sent?",
      "Would you have sex in front of an audience if paid enough?",
      "Have you ever faked enjoyment during the entire act?",
      "Have you ever used sex as manipulation?",
      "What’s your least favorite thing in bed you pretend to like?",
      "Have you ever had sex out of pure spite?",
      "What’s the kink you’re scared people would judge you for?",
      "What’s the riskiest place you’ve done something sexual?",
      "Have you ever cried during sex—and lied about why?",
      "Have you ever had sex and felt disgusted immediately after?",
      "What’s a line you crossed in bed you wish you hadn’t?",
      "Have you ever used sex to get revenge on someone else?",
      "What’s something you did sexually just to feel wanted?",
      "Have you ever slept with someone you couldn't stand?",
      "Have you ever said \"I love you\" during sex just to make it hotter?",
      "Who’s someone you would cheat with and feel no guilt?",
      "What’s a secret fetish you’ve never admitted to a partner?",
      "Ever watched your partner sleep and felt disgust instead of love?",
      "Have you ever fantasized about your best friend’s partner?",
      "Would you ever sleep with an ex just to ruin their new relationship?",
      "Have you ever cheated and blamed the other person emotionally?",
      "What's the darkest thought you've had during sex?",
      "Who’s someone you’d sleep with just for revenge?",
      "Would you stay in a toxic relationship if the sex was incredible?",
      "Have you ever fantasized about someone suffering for rejecting you?",
      "Would you get off watching someone cry over you?",
      "What’s a non-consensual fantasy you’ve never told anyone?",
      "Have you ever imagined having total power over someone’s life?",
      "Would you enjoy watching your ex beg for another chance?",
      "Have you ever wanted someone to stay in love with you forever—even if you stopped loving them?",
      "What’s a morally unacceptable thing you’ve masturbated to?",
      "Have you ever fantasized about a forbidden relationship (age, power, taboo)?",
      "What’s something you know you shouldn’t want—but do?",
      "Have you ever been turned on by fear?"
    ]
  },
  {
    "category": "Love & Relationships",
    "emoji": "❤️",
    "questions": [
      "Have you ever emotionally cheated?",
      "Who’s someone you still think about but shouldn’t?",
      "Who broke your heart the worst—and do they know?",
      "Have you ever ghosted someone for no reason?",
      "Have you ever made someone jealous on purpose?",
      "Do you actually believe in “the one” or is it all coincidences?",
      "Have you ever told someone you love them and didn’t mean it?",
      "What’s the worst thing you’ve done during a breakup?",
      "Would you get back with your ex if they asked today?",
      "Have you ever chosen someone over your partner?",

      "Have you ever made someone fall for you just for fun?",
      "What’s the coldest thing you’ve ever said to someone who loved you?",
      "Would you lie to keep someone in love with you?",
      "What’s a romantic moment you completely faked?",
      "Have you ever ghosted someone after they got vulnerable?",
      "Do you secretly believe love is manipulation in disguise?",
      "What’s the worst way you’ve ever ended things?",
      "Have you ever taken someone back just to hurt them?",
      "Who’s someone you wish loved you—just so you could reject them?",
      "Have you ever stayed in a relationship just to ruin the other person emotionally?",
      "Who’s someone you wish you never loved—but still do?",
      "Have you ever tried to make your partner jealous by flirting with someone in front of them?",
      "What’s the most pathetic thing someone has done to keep you?",
      "Have you ever rejected someone just because they loved you too much?",
      "Who's the most disposable person you've dated?",
      "Have you ever emotionally blackmailed someone and called it love?",
      "Who’s someone who deserves an apology you’ll never give?",
      "Have you ever wanted someone to beg?",
      "What’s the cruelest way you’ve ever broken up with someone?"
    ]
  },
  {
    "category": "Moral Conflicts",
    "emoji": "⚖️",
    "questions": [
      "Would you lie in court to protect a friend?",
      "If your partner cheated and nobody would ever find out, would you want to know?",
      "Would you date someone just for money?",
      "Would you marry someone you don’t love for $1 million?",
      "If someone gave you $500K to never talk to your best friend again, would you take it?",
      "Have you ever emotionally manipulated someone just to feel powerful?",
      "Would you frame someone innocent to save yourself?",
      "Have you ever played the victim to get attention?",
      "Would you fake a mental health crisis for sympathy?",
      "Have you ever wished your partner would die so you could be free?",
      "Would you sleep with someone to get revenge on a friend?",
      "Have you ever ignored someone’s trauma because it bored you?",
      "Would you ruin someone's relationship just because you’re jealous?",
      "What’s the meanest thing you've ever done and felt proud of?",
      "What secret addiction do you hide best?",
      "Do you want to be famous even if it destroys your privacy?",
      "What dark corner of the internet do you visit but never admit?",
      "What’s the most obsessive thing you’ve done over someone?",
      "Have you ever stalked someone online? Who is it?",
      "Have you ever made a fake account to spy on someone?",
      "What’s a secret turn-on you wish you didn’t have?",
      "What’s the last thing you searched that you’d be horrified to explain?",
      "Do you replay arguments or fantasies in your head obsessively?",
      "Have you ever gotten off to the thought of someone crying?",
      "Would you ruin someone’s career to secure your own?",
      "Have you ever used someone you were never attracted to?",
      "What’s the shallowest reason you’ve ever pursued someone?",
      "Would you marry someone 40 years older for luxury?",
      "Do you judge friends who make less money?",
      "Have you ever pretended to be poor or rich for attention?",
      "Who’s someone you only tolerate because they’re useful?",
      "Have you ever befriended someone just for their connections?",
      "Would you fake a relationship for money or fame?",
      "Have you ever felt someone was \"beneath\" you socially?",
      "What’s the most illegal thing you’ve ever wanted to do?",
      "Would you push someone to cheat just to test their loyalty?",
      "Would you ever blackmail someone if you had the dirt?",
      "Have you ever wanted to destroy someone’s life just to feel powerful?",
      "If no one would ever know, who would you kiss… or kill?",
      "Have you ever fantasized about running away and starting a double life?",
      "Have you ever wished someone’s child wasn’t born?",
      "What’s something you’ve done that you think should be unforgivable?"
    ]
  },
  {
    "category": "Greed, Envy, and Status",
    "emoji": "🤑",
    "questions": [
      "Would you rather be rich and hated or poor and loved?",
      "Who’s someone you envy but won’t admit it to them?",
      "Have you ever faked a lifestyle on social media?",
      "Would you throw someone under the bus to keep your job?",
      "Have you ever lied about your income or job?",
      "What’s the most shallow reason you’ve rejected someone?",
      "Would you ever get with someone purely for fame?",
      "If you could erase your past and pretend to be someone else, would you?",
      "Have you ever used someone for clout or access?",
      "Have you ever thought someone was beneath you?"
    ]
  },

  {
    "category": "Dirty Secrets",
    "emoji": "🙊",
    "questions": [
      "What’s something you’ve stolen?",
      "Who’s someone you pretend to like, but would celebrate if they disappeared?",
      "Have you ever wished someone in your life would die?",
      "What’s something illegal you’d do if there were zero consequences?",
      "Ever destroyed something out of rage or jealousy?",
      "Who’s the most toxic person you’ve ever loved?",
      "Have you ever lied to make someone else look bad?",
      "What’s your most shameful moment?"
    ]
  },
  {
    "category": "Dares",
    "emoji": "🔥",
    "questions": []
  },
  {
    "category": "Identity & Self-Deception",
    "emoji": "🎭",
    "questions": [
      "What’s something fake about you?",
      "Do you really like yourself or are you just coping?",
      "Do you think you’re better than most people?",
      "What’s something you constantly lie to yourself about?",
      "What’s something you’ve done to fit in but hated yourself for?",
      "Have you ever changed who you are to be loved?",
      "What’s something you’ll never admit publicly but admit here?"
    ]
  },
  {
    "category": "Mental Health",
    "emoji": "🖤",
    "questions": [
      "What’s something that defines you—but you wish it didn’t?",
      "Who’s the real “you” that only exists when no one’s watching?",
      "Have you ever looked in the mirror and felt disgusted? What one specific part of you?",
      "What do you really think people love you for?",
      "What identity do you perform that you secretly hate?",
      "Have you ever built your personality around what others liked?",
      "What are you most afraid people will find out about you?",
      "What “positive” trait do you secretly fake?",
      "What’s the ugliest part of your personality you keep hidden?",
      "What’s something you know you’ll never admit to your partner?"
    ]
  },
  {
    "category": "Towards the group",
    "emoji": "👀",
    "questions": [
      "Have you ever had a sexual fantasy about someone in this room? Describe it in detail."
    ]
  }
]
